Revit 2024 API
ExternalServiceOptions.SupportActivation Property
 Indicates if the service supports activation/deactivation of the servers.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool SupportActivation { get; set; }
Visual Basic
Public Property SupportActivation As Boolean
	Get
	Set
Visual C++
public:
property bool SupportActivation {
	bool get ();
	void set (bool value);
}
Remarks
If this option is set to true servers can be activated/deactivated.
If this option is set to false, for a single-server only one server can be added(registered) and will be considered active. In case of a multi-server service multiple servers cand be added(registered) and all of them will be considered active. An attempt to activate/deactivate the servers will lead to an exception.
A service for which SupportActivation is set to false, can't be recordable and self-synchronizing.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: A service that doesn't support activation should not be recordable and/or self-syncronizing.
See Also
ExternalServiceOptions Class
Autodesk.Revit.DB.ExternalService Namespace